doom/config.org
#+TITLE: Configuration
#+AUTHOR: Zekun Shi
#+PROPERTY: header-args :emacs-lisp :tangle yes :comments link
#+STARTUP: org-startup-folded: showall
#+BEGIN_SRC emacs-lisp
;; -*- lexical-binding: t -*-
#+END_SRC

* Auth Info
#+BEGIN_SRC emacs-lisp
(setq user-full-name "Zekun Shi"
      user-mail-address "derek.zekun.shi@gmail.com")
#+END_SRC


* Visual Settings

** Themes
Horizon themes need to swap background
#+BEGIN_SRC emacs-lisp
(setq doom-theme 'doom-ayu-dark)
;; (setq doom-theme 'doom-vibrant)
;;(setq doom-theme 'doom-flatwhite)
;;(setq solaire-mode-auto-swap-bg t)
#+END_SRC

** Fonts
Nice condensed fonts.
#+BEGIN_SRC emacs-lisp

(defun fontify-frame (frame)
  (interactive)
  (if window-system
      (progn
        (if (and (> (x-display-pixel-width) 3000) (not (eq system-type 'darwin)))
          (progn (setq doom-font "Iosevka Term SS04:pixelsize=32:foundry=UKWN:weight=regular:slant=normal:width=normal:spacing=90:scalable=true")
                 (setq doom-variable-pitch-font "Iosevka:pixelsize=28:foundry=UKWN:weight=regular:slant=normal:width=normal:spacing=90:scalable=true"))
          (progn (setq doom-font "Iosevka Term SS04:pixelsize=16:foundry=UKWN:weight=regular:slant=normal:width=normal:spacing=90:scalable=true")
                 (setq doom-variable-pitch-font "Iosevka:pixelsize=14:foundry=UKWN:weight=regular:slant=normal:width=normal:spacing=90:scalable=true"))))))


;; Fontify current frame
(fontify-frame nil)

;; Fontify any future frames
(push 'fontify-frame after-make-frame-functions)
#+END_SRC

** Line number
No line number.
#+BEGIN_SRC emacs-lisp
(setq display-line-numbers-type nil)
#+END_SRC

* Org-mode

TODO: change this later
#+begin_src emacs-lisp
(setq org-directory "~/Dropbox/notes/roam/")
#+end_src
** auto tangle
#+begin_src emacs-lisp
(use-package org-auto-tangle
  :defer t
  :hook (org-mode . org-auto-tangle-mode))
#+end_src

* Keybindings

#+begin_src emacs-lisp
(map!

 :v "s" #'evil-surround-region
 :o "S" #'evil-surround-edit
 :n  "]e"    #'move-text-line-down
 :n  "[e"    #'move-text-line-up

 ;; searching
 "C-s" 'swiper
 "C-c s" 'consult-ripgrep

 (:when (modulep! :editor multiple-cursors)
   :nv "C-n" #'evil-mc-make-and-goto-next-match
   :nv "C-p" #'evil-mc-make-and-goto-prev-match)


 (:leader
  ;; calendar
  ;; :n "c" 'my-open-calendar

  :n "RET" 'bookmark-jump

  ;; workspace / window management
  :n "o" 'spacemacs/workspaces-transient-state/body
  :n "0" 'treemacs-select-window
  :n "1" 'winum-select-window-1
  :n "2" 'winum-select-window-2
  :n "3" 'winum-select-window-3
  :n "4" 'winum-select-window-4
  :n "5" 'winum-select-window-5
  :n "6" 'winum-select-window-6
  :n "7" 'winum-select-window-7
  :n "8" 'winum-select-window-8
  :n "9" 'winum-select-window-9
  :n "'" 'spacemacs/shell-pop-multi-vterm
  :n "es" 'flycheck-list-errors

  :n "gs" 'magit-status
  :n "gff" 'magit-find-file
  :n "na" 'org-agenda

  :n "Ts" 'load-theme

  ;; jumps
  :n "ji" 'imenu
  :n "." 'evil-goto-definition
  :n "fb" 'bookmark-jump
  :n "bb" 'switch-to-buffer)


 (:after multi-vterm
         (:map multi-vterm-mode-map
          :leader
          :n "mc" 'multi-vterm
          :n "mp" 'multi-vterm-prev
          :n "mn" 'multi-vterm-next))

 (:after calfw
         (:map cfw:calendar-mode-map
          ;; "<return>" 'cfw:show-details-command
          :n "RET" 'cfw:show-details-command
          :n "SPC" 'nil)

         (:map cfw:details-mode-map
          :n "q" 'cfw:details-kill-buffer-command))




 (:after dap-mode
         (:map dap-mode-map
          :leader
          :n "dd" 'dap-debug
          :n "de" 'dap-debug-edit-template
          :n "d." 'dap-hydra))



 (:after julia-mode
         (:map julia-mode-map
          :n "K" 'eldoc-doc-buffer
          :localleader
          :n "'" '+julia/open-repl)))

(after! evil (evil-escape-mode nil))

;; Make evil-mode up/down operate in screen lines instead of logical lines
(define-key evil-motion-state-map "j" 'evil-next-visual-line)
(define-key evil-motion-state-map "k" 'evil-previous-visual-line)

;; Also in visual mode
(define-key evil-visual-state-map "j" 'evil-next-visual-line)
(define-key evil-visual-state-map "k" 'evil-previous-visual-line)
#+end_src

spacemacs leader
#+BEGIN_SRC emacs-lisp
(setq doom-localleader-key ",")
#+END_SRC

* Dired
** dired follow

#+begin_src emacs-lisp
(define-minor-mode dired-follow-mode
  "Diplay file at point in dired after a move."
  :lighter " dired-f"
  :global t
  (if dired-follow-mode
      (advice-add 'dired-next-line :after (lambda (arg) (dired-display-file)))
    (advice-remove 'dired-next-line (lambda (arg) (dired-display-file)))))
#+end_src
